var a = isNaN('11');

var a = isNaN(2-10);

var b = isNaN('dfdff');


console.log(a);
console.log(b);


// isNaN ফাংশন টা চেক করে যে এই ভ্যালু টাকে সঙ্খ্যায় কনভার্ট করতে পারবে কিনা? 
// সে যদি স্ট্রিং ভ্যালু পায়, মানে অক্ষর পায়,  তখন সে সেই ইনপুট টা কে 
// সঙ্খ্যায় রুপান্তর করতে পারবে না । এবং দেখে বলবে যে , এটা একটা নাম্বার 
// ছিলো না। মানে true রিটার্ন করবে। 

// আর যদি সে স্ট্রিং ফরম্যাটে বা নরমালি সংখ্যা পেয়ে থাকে তখন সে false 
// রিটার্ন করবে। কারন এইটা যে "not a number" নয়।  

// ভ্যালু টা সত্যি সত্যি "not a number" হইলে true রিটার্ন দিবে
// ভ্যালু টা সত্যি সত্যি "not a number" না হইলে false রিটার্ন দিবে

